IdeaRS.OpenModel.Message.MessageNumber.Unspecified


IdeaRS.OpenModel.Message.MessageNumber.Information


IdeaRS.OpenModel.Message.MessageNumber.Warning


IdeaRS.OpenModel.Message.MessageNumber.Error


IdeaRS.OpenModel.Message.MessageNumber.Reserved


IdeaRS.OpenModel.Message.MessageNumber.WarnNoPropertyInData


IdeaRS.OpenModel.Message.MessageNumber.WarnValueOutOfRange


IdeaRS.OpenModel.Message.MessageNumber.WarnCurveCount


IdeaRS.OpenModel.Message.MessageNumber.WarnReinforcementBarsCollision


IdeaRS.OpenModel.Message.MessageNumber.ErrNoOpenObject


IdeaRS.OpenModel.Message.MessageNumber.ErrDataObjectNotCreated


IdeaRS.OpenModel.Message.MessageNumber.ErrNoObjectInOpenModel


IdeaRS.OpenModel.Message.MessageNumber.ErrNoReferenceObjectInOpenModel


IdeaRS.OpenModel.Message.MessageNumber.ErrNoEquivalentObjectInDataModel


IdeaRS.OpenModel.Message.MessageNumber.ErrNoCrossSectionParameter


IdeaRS.OpenModel.Message.MessageNumber.ErrBoltsTooClose


IdeaRS.OpenModel.Message.MessageNumber.ErrBoltsTooCloseEdge


IdeaRS.OpenModel.Message.MessageNumber.ErrContactsAngle


IdeaRS.OpenModel.Message.MessageNumber.ErrIncorrentMaterialE


IdeaRS.OpenModel.Message.MessageNumber.ErrIncorrectMaterialEGP


IdeaRS.OpenModel.Message.MessageNumber.ErrPreloadedBoltGrade


IdeaRS.OpenModel.Message.MessageNumber.ErrValueOutOfRange


IdeaRS.OpenModel.Message.MessageNumber.ErrCurveZeroPoint


IdeaRS.OpenModel.Message.MessageNumber.ErrCurveFunction


IdeaRS.OpenModel.Message.MessageNumber.ErrCurveDecreaseFunction


IdeaRS.OpenModel.Message.MessageNumber.ErrCurveDerivation


IdeaRS.OpenModel.Message.MessageNumber.ErrCurveNotSet


IdeaRS.OpenModel.Message.MessageNumber.ErrValidPolyline


IdeaRS.OpenModel.Message.MessageNumber.ErrWarningLoad


IdeaRS.OpenModel.Message.MessageNumber.ErrTimeout
